index2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>* welcome
welcome to billwear's github pages
** radio
*** eton 750 w/active loop antenna: /QSL for the world/
*** SDR w/rPi4 kit: /trying to phone ET/
** software
*** Emacs: /M-x summon-lost-memories/
*** MAAS documentation: /still just like i left it/
*** MAAS CLI: /latin maas/
*** MAAS image anatomy: /loose bits on deck/
*** MAAS deployment process: /killer fridge art/
** hardware
*** Altair 8800 kit: /jurassic spark/
*** rPi4 kit: /treasure island redux/
*** networking tutorial: /whispering in tcp/ip/
** curiosities
*** text-speak: /IRC runes/
*** phreaking: /here's to Jane Barbe/
** personal
*** about me: /error 404: personality not found/
*** my credo: /life's little manpage/
*** my geek code: /nerd rosetta stone/
** blog (deep and wide for sure)

<!-- 2026-03-27 Fri 12:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Bill Wear" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org51dc1ef">1. welcome</a>
<ul>
<li><a href="#orgd7eed95">1.1. radio</a>
<ul>
<li><a href="#orga9fe26e">1.1.1. eton 750 w/active loop antenna: <i>QSL for the world</i></a></li>
<li><a href="#orgcb73e26">1.1.2. SDR w/rPi4 kit: <i>trying to phone ET</i></a></li>
</ul>
</li>
<li><a href="#org18e645f">1.2. software</a>
<ul>
<li><a href="#org5ceda41">1.2.1. Emacs: <i>M-x summon-lost-memories</i></a></li>
<li><a href="#org3e2ab96">1.2.2. MAAS documentation: <i>still just like i left it</i></a></li>
<li><a href="#org1bdef69">1.2.3. MAAS CLI: <i>latin maas</i></a></li>
<li><a href="#orgc304536">1.2.4. MAAS image anatomy: <i>loose bits on deck</i></a></li>
<li><a href="#org0c652b1">1.2.5. MAAS deployment process: <i>killer fridge art</i></a></li>
</ul>
</li>
<li><a href="#org07514d5">1.3. hardware</a>
<ul>
<li><a href="#orge6bb432">1.3.1. Altair 8800 kit: <i>jurassic spark</i></a></li>
<li><a href="#org124bf4c">1.3.2. rPi4 kit: <i>treasure island redux</i></a></li>
<li><a href="#org44ae827">1.3.3. networking tutorial: <i>whispering in tcp/ip</i></a></li>
</ul>
</li>
<li><a href="#orgb5d29ac">1.4. curiosities</a>
<ul>
<li><a href="#orgafb01eb">1.4.1. text-speak: <i>IRC runes</i></a></li>
<li><a href="#org139b4ab">1.4.2. phreaking: <i>here's to Jane Barbe</i></a></li>
</ul>
</li>
<li><a href="#org7e83381">1.5. personal</a>
<ul>
<li><a href="#org2a86a2f">1.5.1. about me: <i>error 404: personality not found</i></a></li>
<li><a href="#orgca1ae83">1.5.2. my credo: <i>life's little manpage</i></a></li>
<li><a href="#org7419ca6">1.5.3. my geek code: <i>nerd rosetta stone</i></a></li>
</ul>
</li>
<li><a href="#orgf07f46f">1.6. blog (deep and wide for sure)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org51dc1ef" class="outline-2">
<h2 id="org51dc1ef"><span class="section-number-2">1.</span> welcome</h2>
<div class="outline-text-2" id="text-1">
<p>
welcome to billwear's github pages
</p>
</div>
<div id="outline-container-orgd7eed95" class="outline-3">
<h3 id="orgd7eed95"><span class="section-number-3">1.1.</span> radio</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga9fe26e" class="outline-4">
<h4 id="orga9fe26e"><span class="section-number-4">1.1.1.</span> eton 750 w/active loop antenna: <i>QSL for the world</i></h4>
</div>
<div id="outline-container-orgcb73e26" class="outline-4">
<h4 id="orgcb73e26"><span class="section-number-4">1.1.2.</span> SDR w/rPi4 kit: <i>trying to phone ET</i></h4>
</div>
</div>
<div id="outline-container-org18e645f" class="outline-3">
<h3 id="org18e645f"><span class="section-number-3">1.2.</span> software</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5ceda41" class="outline-4">
<h4 id="org5ceda41"><span class="section-number-4">1.2.1.</span> Emacs: <i>M-x summon-lost-memories</i></h4>
</div>
<div id="outline-container-org3e2ab96" class="outline-4">
<h4 id="org3e2ab96"><span class="section-number-4">1.2.2.</span> MAAS documentation: <i>still just like i left it</i></h4>
</div>
<div id="outline-container-org1bdef69" class="outline-4">
<h4 id="org1bdef69"><span class="section-number-4">1.2.3.</span> MAAS CLI: <i>latin maas</i></h4>
</div>
<div id="outline-container-orgc304536" class="outline-4">
<h4 id="orgc304536"><span class="section-number-4">1.2.4.</span> MAAS image anatomy: <i>loose bits on deck</i></h4>
</div>
<div id="outline-container-org0c652b1" class="outline-4">
<h4 id="org0c652b1"><span class="section-number-4">1.2.5.</span> MAAS deployment process: <i>killer fridge art</i></h4>
</div>
</div>
<div id="outline-container-org07514d5" class="outline-3">
<h3 id="org07514d5"><span class="section-number-3">1.3.</span> hardware</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orge6bb432" class="outline-4">
<h4 id="orge6bb432"><span class="section-number-4">1.3.1.</span> Altair 8800 kit: <i>jurassic spark</i></h4>
</div>
<div id="outline-container-org124bf4c" class="outline-4">
<h4 id="org124bf4c"><span class="section-number-4">1.3.2.</span> rPi4 kit: <i>treasure island redux</i></h4>
</div>
<div id="outline-container-org44ae827" class="outline-4">
<h4 id="org44ae827"><span class="section-number-4">1.3.3.</span> networking tutorial: <i>whispering in tcp/ip</i></h4>
</div>
</div>
<div id="outline-container-orgb5d29ac" class="outline-3">
<h3 id="orgb5d29ac"><span class="section-number-3">1.4.</span> curiosities</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgafb01eb" class="outline-4">
<h4 id="orgafb01eb"><span class="section-number-4">1.4.1.</span> text-speak: <i>IRC runes</i></h4>
</div>
<div id="outline-container-org139b4ab" class="outline-4">
<h4 id="org139b4ab"><span class="section-number-4">1.4.2.</span> phreaking: <i>here's to Jane Barbe</i></h4>
</div>
</div>
<div id="outline-container-org7e83381" class="outline-3">
<h3 id="org7e83381"><span class="section-number-3">1.5.</span> personal</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org2a86a2f" class="outline-4">
<h4 id="org2a86a2f"><span class="section-number-4">1.5.1.</span> about me: <i>error 404: personality not found</i></h4>
</div>
<div id="outline-container-orgca1ae83" class="outline-4">
<h4 id="orgca1ae83"><span class="section-number-4">1.5.2.</span> my credo: <i>life's little manpage</i></h4>
</div>
<div id="outline-container-org7419ca6" class="outline-4">
<h4 id="org7419ca6"><span class="section-number-4">1.5.3.</span> my geek code: <i>nerd rosetta stone</i></h4>
</div>
</div>
<div id="outline-container-orgf07f46f" class="outline-3">
<h3 id="orgf07f46f"><span class="section-number-3">1.6.</span> blog (deep and wide for sure)</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bill Wear</p>
<p class="date">Created: 2026-03-27 Fri 12:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
